Revit 2024 API
AlignmentStationLabelSetOptions Constructor
 Create an object with default values.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public AlignmentStationLabelSetOptions()
Visual Basic
Public Sub New
Visual C++
public:
AlignmentStationLabelSetOptions()
See Also
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace